-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/syntax/x_one/log1_sense_1.log
  log type:  text
 opened on:   2 Apr 2024, 19:49:22

. do "/var/folders/cj/8dv18brd2sd49mkfxtpn8j1w0000gn/T//SD02891.000000"

. ** ************************************************************************** **
.         * Health Analysis 
.         * Sensetivity Analsyis Syntax 1 
.         * Part of PhD research on assessing impact of contemporary migration 
.         * patterns the Muslim community in the UK. 
.         * Last updated 2nd Apr 2024
.         * Scot Hunter 
. ** ************************************************************************** **
. ** test to see whether ethnic minority groups more likely to report worse health
. ** outcomes than the majority. 
. 
. *load in data - note no data available for wave 2. 
. foreach wav in a c d e f g h i j k l  {
  2. use pidp `wav'*hcond* using $pprotect/`wav'_indresp_protect.dta, clear
  3.         sort pidp 
  4.         renpfix `wav'_
  5.         gen waveno="`wav'"
  6.         sav  $ptemp/`wav'_hcond.dta, replace 
  7. }
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/a_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/c_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/d_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/e_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/f_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/g_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/h_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/i_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/j_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/k_hcond.dta saved
(Substantive data for responding adults (16+), incl. proxies)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/l_hcond.dta saved

. use $ptemp/a_hcond.dta, clear
(Substantive data for responding adults (16+), incl. proxies)

. foreach wav in  c d e f g h i j k l  {
  2.         append using $ptemp/`wav'_hcond.dta
  3. }

. sort pidp waveno

. sav $ptemp/hcond_mer.dta, replace
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/hcond_mer.dta saved

. global hvars "hcond1 hcond2 hcond3 hcond4 hcond5 hcond6 hcond7 hcond8 hcond11 hcond12 hcond13 hcond14 hcond15 hcond16 hcond96"

. keep pidp wave* $hvars

. codebook, compact 

Variable      Obs Unique       Mean    Min       Max  Label
-------------------------------------------------------------------------------------------------------------------------------------------------------------
pidp       450888  86292   7.82e+08  22445  1.65e+09  cross-wave person identifier (public release)
hcond1     450888      7   -6.72251     -9         1  Asthma
hcond2     450888      7  -6.725158     -9         1  Arthritis
hcond3     450888      7  -6.741237     -9         1  Congestive heart failure
hcond4     450888      7   -6.73982     -9         1  Coronary heart disease
hcond5     450888      7   -6.73864     -9         1  Angina
hcond6     450888      7  -6.739319     -9         1  Heart attack or myocardial infarction
hcond7     450888      7  -6.739769     -9         1  Stroke
hcond8     450888      7  -6.741091     -9         1  Emphysema
hcond11    450888      7  -6.739647     -9         1  Chronic bronchitis
hcond12    450888      7  -6.740421     -9         1  Any kind of liver condition
hcond13    450888      7  -6.737806     -9         1  Cancer or malignancy
hcond14    450888      7  -6.734131     -9         1  Diabetes
hcond15    450888      7  -6.740401     -9         1  Epilepsy
hcond16    450888      7  -6.719935     -9         1  High blood pressure
hcond96    450888      7  -6.653555     -9         1  None of these
waveno     450888     11          .      .         .  
-------------------------------------------------------------------------------------------------------------------------------------------------------------

. foreach var in $hvars {
  2.         recode `var' -100/-1 = . 
  3. }
(383,297 changes made to hcond1)
(383,297 changes made to hcond2)
(383,297 changes made to hcond3)
(383,297 changes made to hcond4)
(383,297 changes made to hcond5)
(383,297 changes made to hcond6)
(383,297 changes made to hcond7)
(383,297 changes made to hcond8)
(383,297 changes made to hcond11)
(383,297 changes made to hcond12)
(383,297 changes made to hcond13)
(383,297 changes made to hcond14)
(383,297 changes made to hcond15)
(383,297 changes made to hcond16)
(383,297 changes made to hcond96)

. sav $ptemp/hcond_mer.dta, replace
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/temp/hcond_mer.dta saved

. * link in micro data from the UKHLS 
. use $pnew/file7.dta, clear
(Substantive data for responding adults (16+), incl. proxies)

. sort pidp waveno

. merge m:m pidp waveno using $ptemp/hcond_mer.dta,

    Result                      Number of obs
    -----------------------------------------
    Not matched                       270,303
        from master                   265,486  (_merge==1)
        from using                      4,817  (_merge==2)

    Matched                           446,071  (_merge==3)
    -----------------------------------------

. keep if _merge == 1 | _merge == 2 | _merge == 3
(0 observations deleted)

. drop _merge 

. recode freshcats -100/-1 = .
(224,242 changes made to freshcats)

. foreach var in $hvars {
  2.         regress `var' i.freshcats dvage
  3. }

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     37.06
       Model |  86.9124616        21  4.13868865   Prob > F        =    0.0000
    Residual |  7333.34402    65,675  .111661119   R-squared       =    0.0117
-------------+----------------------------------   Adj R-squared   =    0.0114
       Total |  7420.25648    65,696  .112948376   Root MSE        =    .33416

-------------------------------------------------------------------------------------
             hcond1 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0419589   .0202119    -2.08   0.038    -.0815742   -.0023437
       2. owhiteb0  |   .0112543   .0117527     0.96   0.338    -.0117811    .0342896
        4. cwhitei  |  -.0230526   .0177858    -1.30   0.195    -.0579128    .0118077
      5. cwhiteoth  |  -.1016314   .0102115    -9.95   0.000    -.1216459   -.0816169
      6. cblackc&a  |  -.0829277   .0082759   -10.02   0.000    -.0991483    -.066707
        9. mindian  |  -.0669199   .0211082    -3.17   0.002    -.1082921   -.0255478
    10. mpakistani  |  -.0593147    .009561    -6.20   0.000    -.0780542   -.0405752
  11. mbangladeshi  |  -.0830498   .0108626    -7.65   0.000    -.1043404   -.0617591
        12. mblack  |  -.1061323   .0140715    -7.54   0.000    -.1337125   -.0785521
       15. hindian  |  -.0822223   .0117317    -7.01   0.000    -.1052165   -.0592281
       16. sindian  |  -.1033095   .0183251    -5.64   0.000    -.1392267   -.0673923
       18. therest  |   -.082515   .0049914   -16.53   0.000    -.0922981   -.0727318
      24. cwhitei2  |  -.0247032   .0170317    -1.45   0.147    -.0580854     .008679
    26. cblackc&a2  |  -.0152018   .0119512    -1.27   0.203    -.0386262    .0082226
      29. mindian2  |  -.0457219   .0223285    -2.05   0.041    -.0894858    -.001958
  210. mpakistani2  |  -.0277494   .0104588    -2.65   0.008    -.0482486   -.0072502
211. mbangladeshi2  |  -.0712338   .0136917    -5.20   0.000    -.0980696    -.044398
     215. hindian2  |  -.0217578    .018149    -1.20   0.231    -.0573298    .0138141
     216. sindian2  |  -.0225363   .0179184    -1.26   0.208    -.0576564    .0125837
     218. therest2  |  -.0061947   .0064729    -0.96   0.339    -.0188816    .0064922
                    |
          dvage_ind |  -.0010023   .0000709   -14.14   0.000    -.0011413   -.0008634
              _cons |   .1889322   .0034784    54.32   0.000     .1821146    .1957498
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    550.62
       Model |  986.749583        21  46.9880754   Prob > F        =    0.0000
    Residual |  5604.50238    65,675  .085336922   R-squared       =    0.1497
-------------+----------------------------------   Adj R-squared   =    0.1494
       Total |  6591.25196    65,696  .100329578   Root MSE        =    .29212

-------------------------------------------------------------------------------------
             hcond2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0177202   .0176695    -1.00   0.316    -.0523524     .016912
       2. owhiteb0  |   .0214018   .0102744     2.08   0.037     .0012639    .0415396
        4. cwhitei  |  -.0006576   .0155486    -0.04   0.966    -.0311329    .0298176
      5. cwhiteoth  |  -.0343633    .008927    -3.85   0.000    -.0518603   -.0168664
      6. cblackc&a  |  -.0361115   .0072349    -4.99   0.000    -.0502919   -.0219312
        9. mindian  |   -.019526   .0184531    -1.06   0.290    -.0556941    .0166421
    10. mpakistani  |  -.0036804   .0083583    -0.44   0.660    -.0200628    .0127019
  11. mbangladeshi  |  -.0303293   .0094962    -3.19   0.001    -.0489419   -.0117167
        12. mblack  |  -.0436584   .0123015    -3.55   0.000    -.0677694   -.0195474
       15. hindian  |  -.0368225    .010256    -3.59   0.000    -.0569243   -.0167207
       16. sindian  |   -.030628     .01602    -1.91   0.056    -.0620273    .0007713
       18. therest  |  -.0522862   .0043635   -11.98   0.000    -.0608388   -.0437337
      24. cwhitei2  |  -.0022229   .0148894    -0.15   0.881     -.031406    .0269603
    26. cblackc&a2  |  -.0207773   .0104479    -1.99   0.047    -.0412552   -.0002994
      29. mindian2  |   .0060703   .0195199     0.31   0.756    -.0321887    .0443292
  210. mpakistani2  |   .0101805   .0091432     1.11   0.266    -.0077402    .0281012
211. mbangladeshi2  |   .0180691   .0119695     1.51   0.131    -.0053911    .0415293
     215. hindian2  |  -.0117732   .0158661    -0.74   0.458    -.0428708    .0193243
     216. sindian2  |  -.0034365   .0156645    -0.22   0.826    -.0341389    .0272659
     218. therest2  |  -.0106127   .0056587    -1.88   0.061    -.0217038    .0004784
                    |
          dvage_ind |   .0063337    .000062   102.19   0.000     .0062122    .0064552
              _cons |  -.1428149   .0030408   -46.97   0.000    -.1487749   -.1368548
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     28.07
       Model |  2.67430408        21  .127347813   Prob > F        =    0.0000
    Residual |  297.937444    65,675  .004536543   R-squared       =    0.0089
-------------+----------------------------------   Adj R-squared   =    0.0086
       Total |  300.611748    65,696    .0045758   Root MSE        =    .06735

-------------------------------------------------------------------------------------
             hcond3 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |   .0064458    .004074     1.58   0.114    -.0015391    .0144308
       2. owhiteb0  |  -.0002476   .0023689    -0.10   0.917    -.0048907    .0043955
        4. cwhitei  |   .0036931    .003585     1.03   0.303    -.0033335    .0107196
      5. cwhiteoth  |   .0033345   .0020583     1.62   0.105    -.0006997    .0073687
      6. cblackc&a  |   -.002503   .0016681    -1.50   0.133    -.0057725    .0007664
        9. mindian  |  -.0048413   .0042546    -1.14   0.255    -.0131804    .0034978
    10. mpakistani  |   -.000919   .0019271    -0.48   0.633    -.0046962    .0028582
  11. mbangladeshi  |   .0009481   .0021895     0.43   0.665    -.0033433    .0052395
        12. mblack  |   .0027654   .0028363     0.97   0.330    -.0027938    .0083245
       15. hindian  |  -.0040021   .0023647    -1.69   0.091    -.0086369    .0006327
       16. sindian  |    .002717   .0036937     0.74   0.462    -.0045226    .0099566
       18. therest  |  -.0009289   .0010061    -0.92   0.356    -.0029008     .001043
      24. cwhitei2  |  -.0016507    .003433    -0.48   0.631    -.0083793    .0050779
    26. cblackc&a2  |   .0002336   .0024089     0.10   0.923    -.0044879    .0049551
      29. mindian2  |   .0014926   .0045006     0.33   0.740    -.0073286    .0103138
  210. mpakistani2  |   .0023575   .0021081     1.12   0.263    -.0017743    .0064894
211. mbangladeshi2  |   .0023127   .0027597     0.84   0.402    -.0030964    .0077219
     215. hindian2  |   .0003229   .0036582     0.09   0.930    -.0068471    .0074929
     216. sindian2  |   .0003367   .0036117     0.09   0.926    -.0067422    .0074156
     218. therest2  |   .0021145   .0013047     1.62   0.105    -.0004427    .0046717
                    |
          dvage_ind |   .0003358   .0000143    23.50   0.000     .0003078    .0003638
              _cons |  -.0094464   .0007011   -13.47   0.000    -.0108206   -.0080722
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     80.26
       Model |  23.0122774        21  1.09582274   Prob > F        =    0.0000
    Residual |  896.737665    65,675  .013654171   R-squared       =    0.0250
-------------+----------------------------------   Adj R-squared   =    0.0247
       Total |  919.749943    65,696   .01400009   Root MSE        =    .11685

-------------------------------------------------------------------------------------
             hcond4 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0037528   .0070679    -0.53   0.595    -.0176058    .0101002
       2. owhiteb0  |    -.00316   .0041098    -0.77   0.442    -.0112152    .0048952
        4. cwhitei  |   .0129506   .0062195     2.08   0.037     .0007604    .0251409
      5. cwhiteoth  |  -.0005229   .0035708    -0.15   0.884    -.0075218    .0064759
      6. cblackc&a  |  -.0122854    .002894    -4.25   0.000    -.0179576   -.0066132
        9. mindian  |  -.0038502   .0073813    -0.52   0.602    -.0183176    .0106172
    10. mpakistani  |  -.0024758   .0033434    -0.74   0.459    -.0090288    .0040772
  11. mbangladeshi  |   .0107308   .0037985     2.82   0.005     .0032857    .0181759
        12. mblack  |   -.003681   .0049207    -0.75   0.454    -.0133255    .0059635
       15. hindian  |   .0049628   .0041024     1.21   0.226     -.003078    .0130036
       16. sindian  |  -.0108387   .0064081    -1.69   0.091    -.0233985    .0017212
       18. therest  |  -.0057401   .0017454    -3.29   0.001    -.0091611    -.002319
      24. cwhitei2  |  -.0039591   .0059558    -0.66   0.506    -.0156325    .0077143
    26. cblackc&a2  |  -.0034459   .0041792    -0.82   0.410    -.0116372    .0047453
      29. mindian2  |   .0025586    .007808     0.33   0.743    -.0127452    .0178623
  210. mpakistani2  |   .0032819   .0036573     0.90   0.370    -.0038865    .0104502
211. mbangladeshi2  |   .0065639   .0047878     1.37   0.170    -.0028202    .0159481
     215. hindian2  |  -.0008235   .0063465    -0.13   0.897    -.0132626    .0116157
     216. sindian2  |   .0048984   .0062659     0.78   0.434    -.0073827    .0171795
     218. therest2  |  -.0001492   .0022635    -0.07   0.947    -.0045857    .0042872
                    |
          dvage_ind |   .0009709   .0000248    39.16   0.000     .0009223    .0010195
              _cons |  -.0255559   .0012163   -21.01   0.000      -.02794   -.0231719
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    143.89
       Model |  62.8750304        21  2.99404907   Prob > F        =    0.0000
    Residual |  1366.59009    65,675  .020808376   R-squared       =    0.0440
-------------+----------------------------------   Adj R-squared   =    0.0437
       Total |  1429.46512    65,696  .021758785   Root MSE        =    .14425

-------------------------------------------------------------------------------------
             hcond5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0043303   .0087252    -0.50   0.620    -.0214316    .0127711
       2. owhiteb0  |   .0132689   .0050735     2.62   0.009     .0033249     .023213
        4. cwhitei  |   .0132341   .0076779     1.72   0.085    -.0018145    .0282828
      5. cwhiteoth  |    .000738   .0044082     0.17   0.867     -.007902     .009378
      6. cblackc&a  |  -.0149998   .0035726    -4.20   0.000     -.022002   -.0079976
        9. mindian  |  -.0044895   .0091121    -0.49   0.622    -.0223493    .0133703
    10. mpakistani  |   .0102686   .0041273     2.49   0.013      .002179    .0183582
  11. mbangladeshi  |   .0001707   .0046892     0.04   0.971    -.0090202    .0093615
        12. mblack  |  -.0112197   .0060745    -1.85   0.065    -.0231257    .0006863
       15. hindian  |  -.0091686   .0050644    -1.81   0.070    -.0190949    .0007576
       16. sindian  |  -.0131406   .0079107    -1.66   0.097    -.0286455    .0023644
       18. therest  |  -.0047782   .0021547    -2.22   0.027    -.0090014   -.0005549
      24. cwhitei2  |   .0013014   .0073524     0.18   0.860    -.0131092     .015712
    26. cblackc&a2  |    -.00468   .0051592    -0.91   0.364     -.014792    .0054319
      29. mindian2  |   .0061405   .0096389     0.64   0.524    -.0127518    .0250327
  210. mpakistani2  |   .0057802   .0045149     1.28   0.200     -.003069    .0146294
211. mbangladeshi2  |   .0100861   .0059105     1.71   0.088    -.0014985    .0216708
     215. hindian2  |   .0005132   .0078347     0.07   0.948    -.0148427    .0158692
     216. sindian2  |   .0005799   .0077351     0.07   0.940    -.0145809    .0157407
     218. therest2  |  -.0010052   .0027943    -0.36   0.719    -.0064819    .0044716
                    |
          dvage_ind |   .0016155   .0000306    52.78   0.000     .0015555    .0016755
              _cons |   -.044405   .0015016   -29.57   0.000     -.047348   -.0414619
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    103.50
       Model |  36.4425549        21  1.73535976   Prob > F        =    0.0000
    Residual |   1101.1461    65,675  .016766595   R-squared       =    0.0320
-------------+----------------------------------   Adj R-squared   =    0.0317
       Total |  1137.58866    65,696   .01731595   Root MSE        =    .12949

-------------------------------------------------------------------------------------
             hcond6 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |   .0110358   .0078321     1.41   0.159    -.0043151    .0263867
       2. owhiteb0  |   .0038828   .0045542     0.85   0.394    -.0050434     .012809
        4. cwhitei  |  -.0040651    .006892    -0.59   0.555    -.0175734    .0094433
      5. cwhiteoth  |  -.0028093   .0039569    -0.71   0.478     -.010565    .0049463
      6. cblackc&a  |  -.0130359   .0032069    -4.06   0.000    -.0193214   -.0067504
        9. mindian  |  -.0035682   .0081794    -0.44   0.663    -.0195999    .0124635
    10. mpakistani  |   .0047599   .0037049     1.28   0.199    -.0025017    .0120214
  11. mbangladeshi  |   .0083288   .0042092     1.98   0.048     .0000787    .0165789
        12. mblack  |  -.0072852   .0054527    -1.34   0.182    -.0179725    .0034022
       15. hindian  |  -.0074858    .004546    -1.65   0.100    -.0163961    .0014244
       16. sindian  |  -.0066522    .007101    -0.94   0.349    -.0205701    .0072657
       18. therest  |  -.0059637   .0019342    -3.08   0.002    -.0097547   -.0021728
      24. cwhitei2  |   .0076806   .0065998     1.16   0.245    -.0052549    .0206162
    26. cblackc&a2  |  -.0004181   .0046311    -0.09   0.928    -.0094951    .0086588
      29. mindian2  |   .0037807   .0086523     0.44   0.662    -.0131778    .0207391
  210. mpakistani2  |   .0053858   .0040528     1.33   0.184    -.0025576    .0133293
211. mbangladeshi2  |   .0100556   .0053055     1.90   0.058    -.0003433    .0204544
     215. hindian2  |  -.0005078   .0070327    -0.07   0.942    -.0142919    .0132763
     216. sindian2  |   .0052248   .0069434     0.75   0.452    -.0083842    .0188338
     218. therest2  |  -.0025886   .0025083    -1.03   0.302    -.0075047    .0023276
                    |
          dvage_ind |   .0012312   .0000275    44.81   0.000     .0011773     .001285
              _cons |  -.0329417   .0013479   -24.44   0.000    -.0355835   -.0302999
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     78.31
       Model |   23.014224        21  1.09591543   Prob > F        =    0.0000
    Residual |  919.074395    65,675  .013994281   R-squared       =    0.0244
-------------+----------------------------------   Adj R-squared   =    0.0241
       Total |  942.088619    65,696  .014340121   Root MSE        =     .1183

-------------------------------------------------------------------------------------
             hcond7 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |   .0031878   .0071553     0.45   0.656    -.0108367    .0172123
       2. owhiteb0  |  -.0010772   .0041607    -0.26   0.796    -.0092321    .0070777
        4. cwhitei  |  -.0014991   .0062965    -0.24   0.812    -.0138402     .010842
      5. cwhiteoth  |  -.0035512    .003615    -0.98   0.326    -.0106366    .0035343
      6. cblackc&a  |  -.0013912   .0029298    -0.47   0.635    -.0071336    .0043512
        9. mindian  |  -.0081595   .0074727    -1.09   0.275     -.022806    .0064869
    10. mpakistani  |  -.0004109   .0033848    -0.12   0.903    -.0070451    .0062232
  11. mbangladeshi  |  -.0009348   .0038455    -0.24   0.808    -.0084721    .0066025
        12. mblack  |  -.0074629   .0049816    -1.50   0.134    -.0172267     .002301
       15. hindian  |  -.0062829   .0041532    -1.51   0.130    -.0144232    .0018574
       16. sindian  |  -.0052425   .0064874    -0.81   0.419    -.0179578    .0074728
       18. therest  |  -.0056545    .001767    -3.20   0.001    -.0091179   -.0021911
      24. cwhitei2  |     .01377   .0060295     2.28   0.022     .0019521    .0255878
    26. cblackc&a2  |  -.0049468   .0042309    -1.17   0.242    -.0132394    .0033459
      29. mindian2  |   .0023669   .0079047     0.30   0.765    -.0131263    .0178601
  210. mpakistani2  |   .0030885   .0037026     0.83   0.404    -.0041686    .0103455
211. mbangladeshi2  |   .0047576   .0048471     0.98   0.326    -.0047427     .014258
     215. hindian2  |   .0018727    .006425     0.29   0.771    -.0107203    .0144658
     216. sindian2  |   .0018386   .0063434     0.29   0.772    -.0105945    .0142717
     218. therest2  |   .0006384   .0022915     0.28   0.781     -.003853    .0051298
                    |
          dvage_ind |   .0009789   .0000251    39.00   0.000     .0009297     .001028
              _cons |  -.0255519   .0012314   -20.75   0.000    -.0279654   -.0231383
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     28.67
       Model |  3.31564848        21  .157888023   Prob > F        =    0.0000
    Residual |  361.634197    65,675  .005506421   R-squared       =    0.0091
-------------+----------------------------------   Adj R-squared   =    0.0088
       Total |  364.949846    65,696   .00555513   Root MSE        =    .07421

-------------------------------------------------------------------------------------
             hcond8 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0029618   .0044884    -0.66   0.509    -.0117591    .0058354
       2. owhiteb0  |  -.0036276   .0026099    -1.39   0.165     -.008743    .0014878
        4. cwhitei  |   .0014149   .0039496     0.36   0.720    -.0063264    .0091562
      5. cwhiteoth  |  -.0032836   .0022676    -1.45   0.148    -.0077281     .001161
      6. cblackc&a  |  -.0070223   .0018378    -3.82   0.000    -.0106244   -.0034202
        9. mindian  |  -.0069938   .0046874    -1.49   0.136    -.0161812    .0021935
    10. mpakistani  |  -.0054257   .0021232    -2.56   0.011    -.0095872   -.0012643
  11. mbangladeshi  |  -.0052595   .0024122    -2.18   0.029    -.0099875   -.0005316
        12. mblack  |   -.004522   .0031248    -1.45   0.148    -.0106467    .0016026
       15. hindian  |  -.0061719   .0026052    -2.37   0.018    -.0112782   -.0010657
       16. sindian  |  -.0084557   .0040694    -2.08   0.038    -.0164317   -.0004797
       18. therest  |  -.0042312   .0011084    -3.82   0.000    -.0064038   -.0020587
      24. cwhitei2  |   .0014866   .0037822     0.39   0.694    -.0059265    .0088996
    26. cblackc&a2  |   -.002991    .002654    -1.13   0.260    -.0081928    .0022107
      29. mindian2  |  -.0003653   .0049584    -0.07   0.941    -.0100838    .0093532
  210. mpakistani2  |  -.0004437   .0023225    -0.19   0.849    -.0049959    .0041085
211. mbangladeshi2  |    .000493   .0030405     0.16   0.871    -.0054663    .0064523
     215. hindian2  |  -.0015894   .0040303    -0.39   0.693    -.0094888    .0063099
     216. sindian2  |  -.0015749   .0039791    -0.40   0.692    -.0093739    .0062241
     218. therest2  |  -.0008974   .0014374    -0.62   0.532    -.0037147      .00192
                    |
          dvage_ind |   .0003514   .0000157    22.32   0.000     .0003206    .0003823
              _cons |  -.0079585   .0007724   -10.30   0.000    -.0094725   -.0064446
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     40.29
       Model |  12.5881448        21  .599435466   Prob > F        =    0.0000
    Residual |  977.037866    65,675  .014876861   R-squared       =    0.0127
-------------+----------------------------------   Adj R-squared   =    0.0124
       Total |   989.62601    65,696  .015063718   Root MSE        =    .12197

-------------------------------------------------------------------------------------
            hcond11 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0071113   .0073775    -0.96   0.335    -.0215712    .0073487
       2. owhiteb0  |   .0074649   .0042899     1.74   0.082    -.0009432    .0158731
        4. cwhitei  |  -.0099291    .006492    -1.53   0.126    -.0226535    .0027952
      5. cwhiteoth  |  -.0088895   .0037273    -2.38   0.017     -.016195    -.001584
      6. cblackc&a  |   -.015847   .0030208    -5.25   0.000    -.0217677   -.0099263
        9. mindian  |  -.0187512   .0077047    -2.43   0.015    -.0338525     -.00365
    10. mpakistani  |  -.0125482   .0034899    -3.60   0.000    -.0193883   -.0057081
  11. mbangladeshi  |  -.0114152    .003965    -2.88   0.004    -.0191865   -.0036439
        12. mblack  |   -.014185   .0051362    -2.76   0.006     -.024252   -.0041179
       15. hindian  |   -.017048   .0042822    -3.98   0.000    -.0254411   -.0086549
       16. sindian  |  -.0184667   .0066888    -2.76   0.006    -.0315768   -.0053566
       18. therest  |  -.0108001   .0018219    -5.93   0.000    -.0143711   -.0072292
      24. cwhitei2  |  -.0023001   .0062167    -0.37   0.711     -.014485    .0098847
    26. cblackc&a2  |  -.0063567   .0043623    -1.46   0.145    -.0149069    .0021934
      29. mindian2  |  -.0020813   .0081501    -0.26   0.798    -.0180556    .0138929
  210. mpakistani2  |  -.0028915   .0038176    -0.76   0.449    -.0103739    .0045909
211. mbangladeshi2  |  -.0049205   .0049976    -0.98   0.325    -.0147158    .0048748
     215. hindian2  |  -.0087674   .0066246    -1.32   0.186    -.0217516    .0042167
     216. sindian2  |  -.0087407   .0065404    -1.34   0.181    -.0215598    .0040785
     218. therest2  |   -.005788   .0023627    -2.45   0.014    -.0104189   -.0011572
                    |
          dvage_ind |   .0006492   .0000259    25.09   0.000     .0005985    .0006999
              _cons |  -.0088708   .0012696    -6.99   0.000    -.0113593   -.0063823
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =     10.02
       Model |  2.10803067        21  .100382413   Prob > F        =    0.0000
    Residual |  658.120138    65,675  .010020862   R-squared       =    0.0032
-------------+----------------------------------   Adj R-squared   =    0.0029
       Total |  660.228169    65,696  .010049747   Root MSE        =     .1001

-------------------------------------------------------------------------------------
            hcond12 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0002149   .0060549    -0.04   0.972    -.0120825    .0116527
       2. owhiteb0  |  -.0006999   .0035208    -0.20   0.842    -.0076007    .0062009
        4. cwhitei  |  -.0023317   .0053281    -0.44   0.662    -.0127749    .0081114
      5. cwhiteoth  |  -.0027112   .0030591    -0.89   0.375     -.008707    .0032845
      6. cblackc&a  |   -.007306   .0024792    -2.95   0.003    -.0121653   -.0024467
        9. mindian  |   -.011424   .0063234    -1.81   0.071    -.0238179      .00097
    10. mpakistani  |  -.0036731   .0028642    -1.28   0.200    -.0092869    .0019408
  11. mbangladeshi  |  -.0049437   .0032541    -1.52   0.129    -.0113218    .0014344
        12. mblack  |  -.0025568   .0042154    -0.61   0.544     -.010819    .0057055
       15. hindian  |  -.0020335   .0035145    -0.58   0.563    -.0089219    .0048549
       16. sindian  |  -.0095473   .0054897    -1.74   0.082    -.0203071    .0012124
       18. therest  |  -.0041362   .0014953    -2.77   0.006     -.007067   -.0012055
      24. cwhitei2  |    .006532   .0051022     1.28   0.200    -.0034684    .0165323
    26. cblackc&a2  |  -.0033889   .0035803    -0.95   0.344    -.0104062    .0036284
      29. mindian2  |   -.006398    .006689    -0.96   0.339    -.0195084    .0067124
  210. mpakistani2  |   .0020012   .0031332     0.64   0.523    -.0041398    .0081422
211. mbangladeshi2  |  -.0041132   .0041017    -1.00   0.316    -.0121525     .003926
     215. hindian2  |  -.0073262   .0054369    -1.35   0.178    -.0179825    .0033302
     216. sindian2  |  -.0044743   .0053679    -0.83   0.405    -.0149952    .0060467
     218. therest2  |  -.0014552   .0019391    -0.75   0.453    -.0052559    .0023454
                    |
          dvage_ind |   .0002665   .0000212    12.55   0.000     .0002248    .0003081
              _cons |   .0000866    .001042     0.08   0.934    -.0019558     .002129
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    110.40
       Model |  60.8221305        21  2.89629193   Prob > F        =    0.0000
    Residual |  1722.92401    65,675  .026234092   R-squared       =    0.0341
-------------+----------------------------------   Adj R-squared   =    0.0338
       Total |  1783.74614    65,696  .027151518   Root MSE        =    .16197

-------------------------------------------------------------------------------------
            hcond13 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |   .0045043   .0097969     0.46   0.646    -.0146976    .0237062
       2. owhiteb0  |   .0016852   .0056967     0.30   0.767    -.0094803    .0128506
        4. cwhitei  |  -.0232777    .008621    -2.70   0.007    -.0401749   -.0063806
      5. cwhiteoth  |  -.0090385   .0049496    -1.83   0.068    -.0187397    .0006627
      6. cblackc&a  |  -.0224513   .0040114    -5.60   0.000    -.0303136   -.0145889
        9. mindian  |  -.0057867   .0102314    -0.57   0.572    -.0258402    .0142668
    10. mpakistani  |  -.0230721   .0046343    -4.98   0.000    -.0321553   -.0139888
  11. mbangladeshi  |  -.0240238   .0052652    -4.56   0.000    -.0343436    -.013704
        12. mblack  |  -.0194148   .0068206    -2.85   0.004    -.0327832   -.0060464
       15. hindian  |  -.0340292   .0056865    -5.98   0.000    -.0451747   -.0228837
       16. sindian  |  -.0309098   .0088824    -3.48   0.001    -.0483192   -.0135004
       18. therest  |  -.0181497   .0024194    -7.50   0.000    -.0228917   -.0134077
      24. cwhitei2  |   .0091039   .0082554     1.10   0.270    -.0070768    .0252846
    26. cblackc&a2  |   -.006313   .0057929    -1.09   0.276     -.017667    .0050411
      29. mindian2  |  -.0005716   .0108229    -0.05   0.958    -.0217844    .0206412
  210. mpakistani2  |  -.0034544   .0050695    -0.68   0.496    -.0133906    .0064818
211. mbangladeshi2  |   .0003369   .0066365     0.05   0.960    -.0126707    .0133445
     215. hindian2  |  -.0102721    .008797    -1.17   0.243    -.0275142      .00697
     216. sindian2  |  -.0016869   .0086852    -0.19   0.846    -.0187099    .0153361
     218. therest2  |  -.0055108   .0031375    -1.76   0.079    -.0116602    .0006387
                    |
          dvage_ind |   .0015146   .0000344    44.07   0.000     .0014473     .001582
              _cons |  -.0308784    .001686   -18.31   0.000    -.0341829   -.0275738
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    192.74
       Model |  189.557772        21  9.02656059   Prob > F        =    0.0000
    Residual |  3075.68944    65,675  .046831967   R-squared       =    0.0581
-------------+----------------------------------   Adj R-squared   =    0.0578
       Total |  3265.24721    65,696  .049702375   Root MSE        =    .21641

-------------------------------------------------------------------------------------
            hcond14 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |   .0154236   .0130896     1.18   0.239     -.010232    .0410792
       2. owhiteb0  |   .0104502   .0076113     1.37   0.170    -.0044679    .0253684
        4. cwhitei  |  -.0306769   .0115185    -2.66   0.008    -.0532531   -.0081007
      5. cwhiteoth  |  -.0050373   .0066132    -0.76   0.446    -.0179991    .0079245
      6. cblackc&a  |   .0409571   .0053596     7.64   0.000     .0304523    .0514619
        9. mindian  |   .0693215   .0136701     5.07   0.000      .042528    .0961149
    10. mpakistani  |   .0946488   .0061919    15.29   0.000     .0825127    .1067849
  11. mbangladeshi  |   .0996227   .0070348    14.16   0.000     .0858344     .113411
        12. mblack  |    .000955    .009113     0.10   0.917    -.0169065    .0188165
       15. hindian  |   .0687283   .0075977     9.05   0.000     .0538368    .0836197
       16. sindian  |   .0745016   .0118677     6.28   0.000     .0512409    .0977623
       18. therest  |    .027119   .0032325     8.39   0.000     .0207832    .0334548
      24. cwhitei2  |  -.0075884   .0110301    -0.69   0.491    -.0292074    .0140306
    26. cblackc&a2  |   .0070907   .0077398     0.92   0.360    -.0080794    .0222608
      29. mindian2  |    .017773   .0144604     1.23   0.219    -.0105693    .0461154
  210. mpakistani2  |   .0151827   .0067733     2.24   0.025      .001907    .0284584
211. mbangladeshi2  |   .0338821    .008867     3.82   0.000     .0165027    .0512615
     215. hindian2  |   .0156258   .0117536     1.33   0.184    -.0074113     .038663
     216. sindian2  |   .0180549   .0116043     1.56   0.120    -.0046896    .0407993
     218. therest2  |   .0137894    .004192     3.29   0.001     .0055731    .0220057
                    |
          dvage_ind |   .0026645   .0000459    58.03   0.000     .0025745    .0027545
              _cons |  -.0676088   .0022527   -30.01   0.000     -.072024   -.0631936
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =      4.68
       Model |  .990946215        21  .047187915   Prob > F        =    0.0000
    Residual |  662.176169    65,675  .010082622   R-squared       =    0.0015
-------------+----------------------------------   Adj R-squared   =    0.0012
       Total |  663.167116    65,696  .010094482   Root MSE        =    .10041

-------------------------------------------------------------------------------------
            hcond15 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0088207   .0060735    -1.45   0.146    -.0207248    .0030835
       2. owhiteb0  |   -.002671   .0035316    -0.76   0.449     -.009593     .004251
        4. cwhitei  |   .0075187   .0053445     1.41   0.159    -.0029566     .017994
      5. cwhiteoth  |  -.0080525   .0030685    -2.62   0.009    -.0140668   -.0020383
      6. cblackc&a  |  -.0100504   .0024868    -4.04   0.000    -.0149246   -.0051762
        9. mindian  |  -.0084504   .0063429    -1.33   0.183    -.0208825    .0039817
    10. mpakistani  |  -.0093088    .002873    -3.24   0.001      -.01494   -.0036777
  11. mbangladeshi  |  -.0115539   .0032641    -3.54   0.000    -.0179516   -.0051562
        12. mblack  |  -.0091621   .0042284    -2.17   0.030    -.0174497   -.0008744
       15. hindian  |  -.0063276   .0035253    -1.79   0.073    -.0132372     .000582
       16. sindian  |  -.0063066   .0055066    -1.15   0.252    -.0170995    .0044863
       18. therest  |  -.0093275   .0014999    -6.22   0.000    -.0122672   -.0063877
      24. cwhitei2  |   .0001107   .0051179     0.02   0.983    -.0099204    .0101419
    26. cblackc&a2  |  -.0028072   .0035913    -0.78   0.434    -.0098461    .0042317
      29. mindian2  |   -.013062   .0067096    -1.95   0.052    -.0262128    .0000887
  210. mpakistani2  |  -.0102349   .0031428    -3.26   0.001    -.0163948    -.004075
211. mbangladeshi2  |  -.0082434   .0041143    -2.00   0.045    -.0163074   -.0001794
     215. hindian2  |  -.0041969   .0054537    -0.77   0.442     -.014886    .0064923
     216. sindian2  |  -.0101037   .0053844    -1.88   0.061    -.0206571    .0004496
     218. therest2  |  -.0034663   .0019451    -1.78   0.075    -.0072786     .000346
                    |
          dvage_ind |  -.0000341   .0000213    -1.60   0.109    -.0000759    7.65e-06
              _cons |     .01387   .0010452    13.27   0.000     .0118214    .0159186
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    593.94
       Model |  1328.22497        21  63.2488079   Prob > F        =    0.0000
    Residual |  6993.76599    65,675  .106490537   R-squared       =    0.1596
-------------+----------------------------------   Adj R-squared   =    0.1593
       Total |  8321.99096    65,696  .126674241   Root MSE        =    .32633

-------------------------------------------------------------------------------------
            hcond16 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |  -.0427612   .0197383    -2.17   0.030    -.0814483    -.004074
       2. owhiteb0  |  -.0190367   .0114774    -1.66   0.097    -.0415324     .003459
        4. cwhitei  |  -.0455714   .0173692    -2.62   0.009     -.079615   -.0115279
      5. cwhiteoth  |  -.0348384   .0099723    -3.49   0.000     -.054384   -.0152927
      6. cblackc&a  |   .0361409    .008082     4.47   0.000     .0203002    .0519815
        9. mindian  |  -.0490734   .0206137    -2.38   0.017    -.0894763   -.0086705
    10. mpakistani  |  -.0133542    .009337    -1.43   0.153    -.0316547    .0049463
  11. mbangladeshi  |   .0085726   .0106081     0.81   0.419    -.0122193    .0293644
        12. mblack  |  -.0329515   .0137419    -2.40   0.016    -.0598856   -.0060174
       15. hindian  |  -.0000905   .0114569    -0.01   0.994     -.022546     .022365
       16. sindian  |  -.0327639   .0178958    -1.83   0.067    -.0678396    .0023118
       18. therest  |  -.0328165   .0048745    -6.73   0.000    -.0423704   -.0232625
      24. cwhitei2  |  -.0178825   .0166327    -1.08   0.282    -.0504826    .0147176
    26. cblackc&a2  |   .0128675   .0116712     1.10   0.270    -.0100082    .0357431
      29. mindian2  |  -.0028833   .0218054    -0.13   0.895    -.0456219    .0398553
  210. mpakistani2  |  -.0043757   .0102138    -0.43   0.668    -.0243947    .0156433
211. mbangladeshi2  |   .0187363    .013371     1.40   0.161    -.0074708    .0449434
     215. hindian2  |  -.0172086   .0177238    -0.97   0.332    -.0519472    .0175301
     216. sindian2  |  -.0119668   .0174986    -0.68   0.494    -.0462641    .0223304
     218. therest2  |  -.0118455   .0063213    -1.87   0.061    -.0242352    .0005442
                    |
          dvage_ind |   .0074013   .0000692   106.90   0.000     .0072656     .007537
              _cons |  -.1547242   .0033969   -45.55   0.000    -.1613821   -.1480663
-------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    65,697
-------------+----------------------------------   F(21, 65675)    =    667.09
       Model |  2801.75436        21  133.416874   Prob > F        =    0.0000
    Residual |  13134.9553    65,675  .199999319   R-squared       =    0.1758
-------------+----------------------------------   Adj R-squared   =    0.1755
       Total |  15936.7096    65,696  .242582648   Root MSE        =    .44721

-------------------------------------------------------------------------------------
            hcond96 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          freshcats |
       1. mwhiteb0  |    .108228   .0270501     4.00   0.000     .0552097    .1612463
       2. owhiteb0  |  -.0067224    .015729    -0.43   0.669    -.0375513    .0241066
        4. cwhitei  |   .0781642   .0238033     3.28   0.001     .0315097    .1248187
      5. cwhiteoth  |   .1711316   .0136663    12.52   0.000     .1443456    .1979177
      6. cblackc&a  |   .1179664   .0110758    10.65   0.000     .0962578     .139675
        9. mindian  |   .1566023   .0282498     5.54   0.000     .1012327    .2119719
    10. mpakistani  |   .0855482   .0127958     6.69   0.000     .0604685    .1106279
  11. mbangladeshi  |   .0961875   .0145377     6.62   0.000     .0676935    .1246814
        12. mblack  |   .1886425   .0188324    10.02   0.000     .1517311     .225554
       15. hindian  |   .1289076   .0157009     8.21   0.000     .0981338    .1596814
       16. sindian  |   .1293574    .024525     5.27   0.000     .0812883    .1774264
       18. therest  |   .1495116   .0066801    22.38   0.000     .1364185    .1626047
      24. cwhitei2  |   .0414097   .0227941     1.82   0.069    -.0032667     .086086
    26. cblackc&a2  |   .0496487   .0159947     3.10   0.002     .0182991    .0809983
      29. mindian2  |   .0677314   .0298829     2.27   0.023     .0091609    .1263019
  210. mpakistani2  |   .0485238   .0139973     3.47   0.001     .0210891    .0759585
211. mbangladeshi2  |   .0856251    .018324     4.67   0.000       .04971    .1215402
     215. hindian2  |   .0762675   .0242893     3.14   0.002     .0286604    .1238746
     216. sindian2  |   .0644678   .0239807     2.69   0.007     .0174656      .11147
     218. therest2  |    .030971   .0086629     3.58   0.000     .0139917    .0479503
                    |
          dvage_ind |  -.0101687   .0000949  -107.17   0.000    -.0103547   -.0099827
              _cons |   .9784325   .0046552   210.18   0.000     .9693083    .9875567
-------------------------------------------------------------------------------------

. save $pnew/health_sense.dta, replace
(file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/newdata/health_sense.dta not found)
file /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/data/newdata/health_sense.dta saved

. 
. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/scothunter/Library/CloudStorage/OneDrive-UniversityofStirling/thesis/directory/syntax/x_one/log1_sense_1.log
  log type:  text
 closed on:   2 Apr 2024, 19:49:58
-------------------------------------------------------------------------------------------------------------------------------------------------------------
